export const COUNT_PHOTOS = 25;

export const MAX_HASHTAGS_COUNT = 5;

export const MAX_DESCRIPTION_LENGTH = 140;

export const SCALE = {
  MIN: 25,
  MAX: 100
};

export const SCALE_STEP = 25;

export const DEFAULT_SCALE = 100;

export const MESSAGES_EXAMPLES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

export const NAMES_EXAMPLES = ['Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей',
  'Екатерина','Арина', 'Полина', 'Ольга', 'Юлия', 'Татьяна'];

export const DESCRIPTIONS_EXAMPLES = ['Восторг!', 'Шедевр', 'Поставлю в рамочку', 'Необычный объект', 'Практически НЛО',
  'Что это вообще??', 'Нет слов', 'Описание съел Кекс', 'Возможно, это скульптура', 'Просто фото'];
